[
    {
        "id": 0,
        "name": "Iron Man",
        "rating": 5,
        "availability": 9,
        "review": "Tony Stark is a billionaire industrialist and genius inventor who is kidnapped and forced to build a devastating weapon. Instead, using his intelligence and ingenuity, Tony builds a high-tech suit of armor and escapes captivity. When he uncovers a nefarious plot with global implications, he dons his powerful armor and vows to protect the world as Iron Man. (Paramount Pictures, Marvel Studios)",
        "thumb": "img/iron.jpg"
        },
    {
        "id": 1,
        "name": "The Avengers",
        "rating": 5,
        "availability": 3,
        "review": "One of the weapons Marvel used in its climb to comic-book dominance was a willingness to invent new characters at a dizzying speed. There are so many Marvel universes, indeed, that some superheroes do not even exist in one another's worlds, preventing gridlock. The Avengers however do share the same time and space continuum, although in recent years, they've been treated in separate, single-superhero movies. One assumes the idle Avengers follow the exploits of the employed ones on the news.",
        "thumb": "img/avengers.jpg"
        },
    {
        "id": 2,
        "name": "The Dark Knight",
        "rating": 5,
        "availability": 5,
        "review": "The Dark Knight is a 2008 superhero film directed, co-produced, and co-written by Christopher Nolan. Featuring the DC Comics character Batman, the film is the second part of Nolan's The Dark Knight Trilogy and a sequel to 2005's Batman Begins, starring an ensemble cast including Christian Bale, Michael Caine, Heath Ledger, Gary Oldman, Aaron Eckhart, Maggie Gyllenhaal and Morgan Freeman. ",
        "thumb": "img/dark.jpg"
        },
    {
        "id": 3,
        "name": "Avatar",
        "rating": 4,
        "availability": 3,
        "review": "Jake Sully is a former Marine confined to a wheelchair. But despite his broken body, Jake is still a warrior at heart. He is recruited to travel light years to the human outpost on Pandora, where a corporate consortium is mining a rare mineral that is the key to solving Earth's energy crisis. Because Pandora's atmosphere is toxic, they have created the Avatar Program, in which human drivers  have their consciousness linked to an avatar, a remotely-controlled biological body that can survive in the lethal air.",
        "thumb": "img/avatar.jpg"
        },
    {
        "id": 4,
        "name": "The Incredible Hulk",
        "rating": 5,
        "availability": 18,
        "review": " The Incredible Hulk kicks off an all-new, explosive and action-packed epic of one of the most popular Super Heroes of all time. In the film, scientist Bruce Banner desperately hunts for a cure to the gamma radiation that poisoned his cells and unleashes the unbridled force of rage within him: The Hulk. Living in the shadows—cut off form a life he knew and the woman he loves, Betty Ross—Banner struggles to avoid the obsessive pursuit of his nemesis, General Thunderbolt Ross and the military machinery that seeks to capture him and brutally exploit his power. As all three grapple with the secrets that led to The Hulk’s creation, they are confronted with a monstrous new adversary known as the Abomination, whose destructive strength exceeds even The Hulk’s own. (Universal Studios)",
        "thumb": "img/hulk.jpg"
        },
    {
        "id": 6,
        "name": "Eragon",
        "rating": 3,
        "availability": 6,
        "review": "Eragon is a 2006 British-American action-fantasy film directed by Stefen Fangmeier (in his directorial debut) and written by Peter Buchman, based on the novel of the same name by Christopher Paolini. The film stars Ed Speleers in the title role as well as Jeremy Irons, Garrett Hedlund, Sienna Guillory, Robert Carlyle, John Malkovich, Djimon Hounsou, Alun Armstrong and Joss Stone, with Rachel Weisz as the voice of Saphira the dragon.",
        "thumb": "img/eragon.jpg"
        },
    {
        "id": 7,
        "name": "Spider-Man",
        "rating": 3,
        "availability": 2,
        "review": "Spider-Man is a 2002 American superhero film directed by Sam Raimi. Based on the Marvel Comics character of the same name, the film stars Tobey Maguire as Peter Parker, a high school student living in New York City, who turns to crimefighting after developing spider-like super powers. ",
        "thumb": "img/spider.jpg"
        },
    {
        "id": 8,
        "name": "Inception",
        "rating": 3,
        "availability": 6,
        "review": "Inception is a 2010 science fiction film written, co-produced, and directed by Christopher Nolan, and co-produced by Emma Thomas. The film stars Leonardo DiCaprio as a professional thief who steals information by infiltrating the subconscious, and is offered a chance to have his criminal history erased as payment for a seemingly impossible task: inception, the implantation of another person's idea into a target's subconscious.",
        "thumb": "img/inception.jpg"
        },
        {
        "id": 9,
        "name": "Twilight",
        "rating": 3,
        "availability": 6,
        "review": " Twilight is a 2008 American romantic fantasy film based on Stephenie Meyer's popular novel of the same name. Directed by Catherine Hardwicke, the film stars Kristen Stewart and Robert Pattinson. It is the first film in The Twilight Saga film series. This film focuses on the development of the relationship between Bella Swan (a teenage girl) and Edward Cullen (a vampire), and the subsequent efforts of Edward and his family to keep Bella safe from a coven of evil vampires.",
        "thumb": "img/Twilight.jpg"
        }
    ]